maxwellalec868-lang/autonomous_car_project/drivers/Src/stm32f334xx_i2c_driver.c
/*
 * stm32f334xx_i2c_driver.c
 *
 *  Created on: Feb 19, 2026
 *      Author: amaxw
 */

#include "stm32f334xx_i2c_driver.h"

/**************************************************************************************
 * @fn					- I2C_Peri_ClockControl
 *
 * @brief				- Function to enable or disable I2Cs peripheral clock
 *
 * @param[in]			- EnorDi: ENABLE OR DISABLE Macros
 *
 * @return				- void
 *
 * @Note				- None
 *
 **************************************************************************************/
void I2C_Peri_ClockControl(uint8_t EnorDi){
	if (EnorDi == ENABLE){
		I2C1_PCLK_EN();
	}
	else{
		I2C1_PCLK_DI();
	}
}



/**************************************************************************************
 * @fn					- I2C_Clock_Choice
 *
 * @brief				- Function to choose which clock the I2C clock should use. Can be HSI or SYSCLK
 *
 * @param[in]			- HsiOrSysclk: Call either HSI or SYSCLK macros to set HSI or SYSCLK as the I2C clock
 *
 * @return				- void
 *
 * @Note				- Sysclk could be any configurable clock (HSI, HSE, PLL, etc.). VERIFY AND IMPROVE THIS STATEMENT ONCE I NEED TO USE SYSCLK
 * 						- Possibly add else statement to handle input not HSI or SYSCLK (0 or 1). NOT SURE HOW THIS HANDLED IN DRIVER DEV; FIGURE OUT
 *
 **************************************************************************************/
void I2C_Clock_Choice(uint8_t HsiOrSysclk){
	if (HsiOrSysclk ==  HSI){
		SET_HSI();
	}
	else if (HsiOrSysclk == SYSCLK){
		SET_SYSCLK();
	}
}


/**************************************************************************************
 * @fn					- I2C_Clock_Config
 *
 * @brief				- Function to set all required registers to ensure that SCL runs at the desired speed
 *
 * @param[in]			- i2c_freq: Frequency that the I2C periperhal clock is set as
 * @param[in]			- mode: Desired mode of I2C SCL clock line (standard (10 kHz), standard (100 kHz), fast (400 kHz), and fast plus (500 kHz)
 *
 * @return				- void
 *
 * @Note				- As of now,  the only i2c_freq allowed will be 8 MhZ. I am developing the driver to only function when that clock is being used.
 * 						- Doing this because (1) I dont need anything faster for now (I think) and (2) I am not sure how to get clock higher than 8 MHz (need PLL i believe)
 *
 **************************************************************************************/
// UNDERSTAND WHY THIS IS PASSED AS POINTER. DONE IN GPIO BUT CANT REMEMBER WHY EXACTLY
void I2C_Clock_Config(I2C_Handle_t* pI2CHandle){
	if (pI2CHandle->I2C_PinConfig.I2C_FREQ == I2C_FREQ_8MHZ){
		if (pI2CHandle->I2C_PinConfig.I2C_MODE == STANDARD_10K){
			// Based on mode and f_i2cclk set:
			// 1. Set PSC
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 28);
			pI2CHandle->pI2C1->TIMINGR |= (PRESC_STAN_8 << 28);

			// 2. Set SCLL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 0);
			pI2CHandle->pI2C1->TIMINGR |= (SCLL_STAN10_8  << 0);

			// 3. Set SCLH
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 8);
			pI2CHandle->pI2C1->TIMINGR |= (SCLH_STAN10_8  << 8);

			// 4. Set SDADEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 16);
			pI2CHandle->pI2C1->TIMINGR |= (SDADEL_STAN_8  << 16);

			// 5. Set SCLDEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 20);
			pI2CHandle->pI2C1->TIMINGR |= (SCLDEL_STAN_8  << 20);
		}

		else if (pI2CHandle->I2C_PinConfig.I2C_MODE == STANDARD_100K){
			// 1. Set PSC
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 28);
			pI2CHandle->pI2C1->TIMINGR |= (PRESC_STAN_8 << 28);

			// 2. Set SCLL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 0);
			pI2CHandle->pI2C1->TIMINGR |= (SCLL_STAN100_8  << 0);

			// 3. Set SCLH
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 8);
			pI2CHandle->pI2C1->TIMINGR |= (SCLH_STAN100_8  << 8);

			// 4. Set SDADEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 16);
			pI2CHandle->pI2C1->TIMINGR |= (SDADEL_STAN_8  << 16);

			// 5. Set SCLDEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 20);
			pI2CHandle->pI2C1->TIMINGR |= (SCLDEL_STAN_8  << 20);
		}

		else if (pI2CHandle->I2C_PinConfig.I2C_MODE == FAST){
			// 1. Set PSC
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 28);
			pI2CHandle->pI2C1->TIMINGR |= (PRESC_FAST_8 << 28);

			// 2. Set SCLL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 0);
			pI2CHandle->pI2C1->TIMINGR |= (SCLL_FAST_8  << 0);

			// 3. Set SCLH
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 8);
			pI2CHandle->pI2C1->TIMINGR |= (SCLH_FAST_8  << 8);

			// 4. Set SDADEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 16);
			pI2CHandle->pI2C1->TIMINGR |= (SDADEL_FAST_8  << 16);

			// 5. Set SCLDEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 20);
			pI2CHandle->pI2C1->TIMINGR |= (SCLDEL_FAST_8  << 20);
		}

		else if (pI2CHandle->I2C_PinConfig.I2C_MODE == FAST_PLUS){
			// 1. Set PSC
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 28);
			pI2CHandle->pI2C1->TIMINGR |= (PRESC_FAST_PLUS_8 << 28);

			// 2. Set SCLL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 0);
			pI2CHandle->pI2C1->TIMINGR |= (SCLL_FAST_PLUS_8  << 0);

			// 3. Set SCLH
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFFU << 8);
			pI2CHandle->pI2C1->TIMINGR |= (SCLH_FAST_PLUS_8  << 8);

			// 4. Set SDADEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 16);
			pI2CHandle->pI2C1->TIMINGR |= (SDADEL_FAST_PLUS_8  << 16);

			// 5. Set SCLDEL
			pI2CHandle->pI2C1->TIMINGR &= ~(0xFU << 20);
			pI2CHandle->pI2C1->TIMINGR |= (SCLDEL_FAST_PLUS_8  << 20);
		}
	}
	// TODO: Implement driver for 16 MHz. Not using for now, will implement if I ever need to

}


/**************************************************************************************
 * @fn					- I2C_Peri_Control
 *
 * @brief				- Function to enable or disable/reset the I2C peripheral through the PE bit in CR1.
 * 						- This bit must be at 0 to set any configs for I2C and msut be 1 for the peripheral to work
 * 						- Setting this bit to 0 after configuration will affectively reset everything back to a normal state. (See 27.4.6 in RM for more info on this)
 *
 * @param[in]			- pI2Cx: Pointer to a I2C register definition struct which holds all registers for I2C peripheral. Allows access to PE bit in CR1.
 * @param[in]			- EnorRst: Value will be either ENABLE or DISABLE
 *
 * @return				- void
 *
 * @Note				- NOTE 1: Must remember that setting PE to 0 will affectively reset the periperhal!
 * 						- NOTE 2: As of now, pI2Cx will only be I2C1. Could have hard coded that into here but leaving it more versatile by passing a param for which I2C
 * 						-         register set/peripheral will be used (Could be I2C2 in future; need to look into this).
 * 						- NOTE 3: Possibly make this static inline and call in another function. GPT reccomended but need to understand it better before I do this
 *
 **************************************************************************************/
void I2C_Peri_Control(I2C_RegDef_t* pI2Cx, uint8_t EnorDi){
	//	TODO: Implement logic
	if (EnorDi == ENABLE){
		pI2Cx->CR1 |= (1U << 0);
	}
	else{
		pI2Cx->CR1 &= ~(1U << 0);
	}

