maxwellalec868-lang/autonomous_car_project/drivers/Src/stm32f334xx_i2c_driver.c
}




/**************************************************************************************
 * @fn					- I2C_Init
 *
 * @brief				- Will initialize all config settings that are required to be set in CR1. Will essentially be all
 * 						  config settings independent of state (master/slave, TX/RX)

 *
 * @param[in]			- pI2CHandle: Struct to take in user input for config settings and set them appropriately in the register definition for I2C
 *
 * @return				- void
 *
 * @Note				- As of now, this function only handles configuration of bits in CR1. Edit this if that changes.
 * 						- See handles comment below for configs
 * 						- This must be called before I2C_Peri_Control() is called as these can only be set when PE = 0
 *
 **************************************************************************************/
void I2C_Init(I2C_Handle_t* pI2CHandle){
	/*
	 * TODO: Might add error checking with the enum I made to certain configs
	 *
	 * Handles:
	 * (1) Analog filter config
	 * (2) Digital filter config
	 * (3) Error interrupts
	 * (4) SMBus config
	 * (5) Clock strecthing config
	 * */

	// (1) Analog filtering is handled by CR1 bit 12
	if (pI2CHandle->I2C_PinConfig.I2C_ANLG_FILTER_CTRL == ANLG_FILTER_EN){
		pI2CHandle->pI2C1->CR1 &= ~(1U << 12);
	}
	else{
		pI2CHandle->pI2C1->CR1 |= (1U << 12);
	}

	// (2) Digital filtering handled by bits 8-11
	if (pI2CHandle->I2C_PinConfig.I2C_DIGI_FILTER_CTRL == DIGI_FILTER_DI){
		pI2CHandle->pI2C1->CR1 &= ~(0xFU << 8);
	}
	else{
		uint32_t tmp_CR1 = pI2CHandle->pI2C1->CR1;
		tmp_CR1 &= ~(0xFU << 8);
		tmp_CR1 |= (pI2CHandle->I2C_PinConfig.I2C_DIGI_FILTER_CTRL);

		pI2CHandle->pI2C1->CR1 = tmp_CR1;
	}

	/*(3) Error Interrupts - Bit 7 in CR1 (Disabled by default)
	 * NOTE: May need to add aditional code here. this just enables error interrupts to occur. More work needed
	 * */
	if (pI2CHandle->I2C_PinConfig.I2C_ERR_INTERRUPT_EN == ENABLE){
		pI2CHandle->pI2C1->CR1 |= (1U << 7);
	}
	else{
		pI2CHandle->pI2C1->CR1 &= ~(1U << 7);
	}

	/* (4) SMBus Config - TODO: Should set bus as (1) I2C_Mode, (2) SMBUS_HOST - Set , (3) SMBUS_DEVICE
	 * Do not need anything besides I2C_Mode for now which is default. Will just clear all bits that may set to SMBUS mode for I2C mode. Implement if ever using SMBUS
	 */

	/*
	 * (5) Config clock stretching. Only really matters when in slave mode. Handle here, may use later if using STM32 in slave mode
	 * Handled by CR1 Bit 17
	 * */

	if (pI2CHandle->I2C_PinConfig.I2C_CLK_STRETCH == ENABLE){
		pI2CHandle->pI2C1->CR1 &= ~(1U << 17);
	}
	else{
		pI2CHandle->pI2C1->CR1 |= (1U << 17);
	}

}




/**************************************************************************************
 * @fn					- I2C_Config_Master
 *
 * @brief				- Will initialize all config settings that are required to be set in CR2 to configure STM32 as master device

 *
 * @param[in]			- pI2CHandle: Struct to take in user input for config settings and set them appropriately in the register definition for I2C
 *
 * @return				- void
 *
 * @Note				- As of now, this function only handles configuration of bits in CR2. Edit this if that changes.
 * 						- See handles comment below for configs
 *
 **************************************************************************************/
I2C_Status_t I2C_Config_Master(I2C_Handle_t* pI2CHandle){
	/*
		 * Handles:
		 * (1) MUST SET: Adressing mode (7-bit or 10-bit)
		 * (2) MUST SET: Slave address selection
		 * (3) MUST SET: Transfer direction (TX/RX)
		 * (4) Program HEAD10R bit (Only matters if 10-bit addr used)
		 * (5) MUST SET: Set number of bytes to transfer
		 * (6) Config AUTOEND
		 * */


	/* (1) Adressing mode (7-bit or 10-bit) and (2) Slave address selection
	 * In 7-bit mode: SADD[7:1] should bre written with address. SADD[9], SADD[8], and SADD[0] are dont care
	 * 10-bit Mode: Uses SADD[9:0]
	 * */
	// Start by validating the address
	if ((pI2CHandle->I2C_PinConfig.I2C_ADDR_MODE == ADDR_MODE_7BIT) && (pI2CHandle->I2C_PinConfig.I2C_SLAVE_ADDR > 0x7F))
	    return I2C_ERR_INVALID_ADDR;

	if ((pI2CHandle->I2C_PinConfig.I2C_ADDR_MODE == ADDR_MODE_10BIT) && (pI2CHandle->I2C_PinConfig.I2C_SLAVE_ADDR > 0x3FF))
	    return I2C_ERR_INVALID_ADDR;

	if (pI2CHandle->I2C_PinConfig.I2C_ADDR_MODE == ADDR_MODE_7BIT){
		pI2CHandle->pI2C1->CR2 &= ~(1U << 11); // Set to 7-bit addr mode

	    uint16_t slv_addr = pI2CHandle->I2C_PinConfig.I2C_SLAVE_ADDR & 0x7F; // Ensures first 7 bits are only values set. Kind of overkill when using memset() on struct as
	    																	//  memset() ensures register value is stored in gets set to 0. (AT LEAST FOR EARLY TESTING; VERIFY)

	    pI2CHandle->pI2C1->CR2 &= ~(0x3FFU << 0); // Clears first 10-bits of CR2 which is SADD[9:0]
		pI2CHandle->pI2C1->CR2 |= (slv_addr << 1);
	}

	else if (pI2CHandle->I2C_PinConfig.I2C_ADDR_MODE == ADDR_MODE_10BIT){
		pI2CHandle->pI2C1->CR2 |= (1U << 11); // Set to 10-bit addr mode

		uint16_t slv_addr = pI2CHandle->I2C_PinConfig.I2C_SLAVE_ADDR & 0x3FF;

		pI2CHandle->pI2C1->CR2 &= ~(0x3FFU << 0); // Clears first 10-bits of CR2 which is SADD[9:0]
		pI2CHandle->pI2C1->CR2 |= slv_addr;

		/* (4) Program HEAD10R bit (Only matters if 10-bit addr used)
		 * Common to never set HEAD10R. Here if needed, but also gurantees that it is set to 0
		 * */
		if (pI2CHandle->I2C_PinConfig.I2C_HEAD10R_EN == ENABLE){
			pI2CHandle->pI2C1->CR2 |= (1U << 12);
		}
		else{
			pI2CHandle->pI2C1->CR2 &= ~(1U << 12);
		}
	}

	else{
		return I2C_ERR_INVALID_ADDR_MODE; // Alerts in driver, handled in main
	}



	/* (3) Transfer direction (TX/RX). Handled by CR2 bit 10 */
	if (pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR == WRITE){
		pI2CHandle->pI2C1->CR2 &= ~(1U << 10);
	}

	else if(pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR == READ){
		pI2CHandle->pI2C1->CR2 |= (1U << 10);
	}

	else{
		return I2C_ERR_INVALID_RD_WR;
	}

	/*(5) MUST SET: Set number of bytes to transfer.
	 * Irrelevant when in slave mode.
	 * TODO: If I ever want to transfer more than 255 bytes, I must use RELOAD register and update NBYTES. Will need to research this if necesarry
	 *  */
	uint32_t num_bytes = ((uint32_t)pI2CHandle->I2C_PinConfig.I2C_NBYTES) & (0xFFU); // Ensures only first 8-bits are set. Prevents values over 8-bits from being set

	pI2CHandle->pI2C1->CR2 &= ~(0xFFU << 16); // Clear bits 16-23 to ensure value gets set correctly
	pI2CHandle->pI2C1->CR2 |= (num_bytes << 16);


	/* (6) Config AUTOEND
	 * AUTOEND enabled means a STOP condition is automatically sent when NBYTES data are transferred.
	 * Has no effect in slave mode or when RELOAD bit is set
	 * */
	if (pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN == ENABLE){
		pI2CHandle->pI2C1->CR2 |= (1U << 25);
	}
	else{
		pI2CHandle->pI2C1->CR2 &= ~(1U << 25);
	}

	return I2C_OK;
}


// Might call this at beginning of master transmitter function
void I2C_Start(I2C_RegDef_t* pI2Cx){
	/*Set the START bit to begin data transfer*
	 * TODO: Does this bit automatically get reset after NBYTES is sent ? Understand this!
	 */

