maxwellalec868-lang/autonomous_car_project/drivers/Src/stm32f334xx_i2c_driver.c
	pI2Cx->CR2 |= (1 << 13);
}

void I2C_Stop(I2C_RegDef_t* pI2Cx){
	/* Set I2C stop bit.
	 * This bit is cleared by hardware
	 * */
	pI2Cx->CR2 |= (1 << 14);
}


void I2C_Clear_Flags(I2C_RegDef_t* pI2Cx){
	// Clear the flags that are set in ISR register
	// For now just clear NACKF (bit 4) and STOPF (bit 5). Will make better late
    pI2Cx->ICR |= (1U << 4); // NACKCF
    pI2Cx->ICR |= (1U << 5); // STOPCF

}



/**************************************************************************************
 * @fn					- I2C_Master_TX
 *
 * @brief				- Calls start() and manages the transfer of data when master wants to transmit

 *
 * @param[in]			- pI2CHandle: Struct to take in user input for config settings and use them to implement logic in this function. Also allows access to I2C registers
 *						- pData_buf: Array (pointer) that contains all the data that should be transferred
 *						- repeated_start: If 1 then dont set STOP bit, else continue on and set STOP bit using current transfer completion code. This param used to allow for
 *						  this function to be used in I2C_Master_Reg_Read() which requires that STOP not set so RX can happen in same I2C event as initialization of slave reg
 *
 *
 * @return				- I2C_Status_t
 *
 * @Note				- NOTE: This function assumes that I2C_Config_Master() has been called prior to this function. This function will not function correctly if it is not
 * 						- called first.
 * 						- Also, I2C_NBYTES must be configured. This is a requirement for data TX
 * 						- This is a polling based function. WIll implement one with interrupts later and probably just use that in the future. But this is a good start
 *
 **************************************************************************************/
I2C_Status_t  I2C_Master_TX(I2C_Handle_t* pI2CHandle, uint8_t* pData_buf, uint8_t repeated_start){
	// (1) Call I2C_Start()
	// (2) Watch TXIS flag, if 1 (empty) then write data to TXDR. Else recheck(might need to better this)
	// (3) Repeat this until NBYTES is transferred and if TC = 1 (if AUTOEND = 0) or STOPF = 1 (if AUTOEND = 1)
	/* TODO:
	 * (1) Add timeout protection when polling
	 * */

	if ((pI2CHandle == NULL) || (pI2CHandle->pI2C1 == NULL) || (pData_buf == NULL) || (pI2CHandle->I2C_PinConfig.I2C_NBYTES == 0U) || (pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR != WRITE
			)) {
	    return I2C_ERR_INVALID_PARAM;
	}

	if ((repeated_start == 1U) && (pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN != 0U)) {
	    return I2C_ERR_INVALID_PARAM;
	}


	// Wait for bus to be free (not BUSY)
	// TODO: Add timeout in this so it doesnt hang forever if an error occurss (STOPF never set). Fine for now since doing early testing
	while (pI2CHandle->pI2C1->ISR & (1U << 15));

	I2C_Start(pI2CHandle->pI2C1);
	uint8_t ind = 0;



	// First handle data transfer
	while (ind < pI2CHandle->I2C_PinConfig.I2C_NBYTES){

		// Wait till TXIS is set
		while (!(pI2CHandle->pI2C1->ISR & (1U << 1))){
			// if NACK returned, return err enum
			if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
				pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
                return I2C_ERR_NACK;
			}
		}

		 pI2CHandle->pI2C1->TXDR = pData_buf[ind];
		ind++;
	}


	// Then handle transfer completion
	if (pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN == 0){

		// Condition to handle if this function should be used to simply send an address to initialize slave for reading
		if (repeated_start == 1){
			while (!(pI2CHandle->pI2C1->ISR & (1U << 6))){ // Wait till TC bit is set
				if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
					pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
					return I2C_ERR_NACK;
				}
			}

			return I2C_OK;
		}


		while (!(pI2CHandle->pI2C1->ISR & (1U << 6))){ // Wait till TC bit is set
			if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
				pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
				return I2C_ERR_NACK;
			}
		}

		// Stop I2C after I2C TC bit is set. Then wait until STOPF flag set to ensure its actually set before code moves on
		I2C_Stop(pI2CHandle->pI2C1);
		while (!(pI2CHandle->pI2C1->ISR & (1U << 5))) {
		    if (pI2CHandle->pI2C1->ISR & (1U << 4)) {
		        pI2CHandle->pI2C1->ICR |= (1U << 4);
		        return I2C_ERR_NACK;
		    }
		}

	}

	else{
		while (!(pI2CHandle->pI2C1->ISR & (1U << 5))){ // Wait till STOPF bit is set
			if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
				pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
				return I2C_ERR_NACK;
			}
		}
	}

	// Clear STOPF (using STOPCF) so another transfer can be successfully initialized
	if ((pI2CHandle->pI2C1->ISR & (1U << 5))){
		pI2CHandle->pI2C1->ICR |= (1U << 5);

	}

	return I2C_OK;

}



/**************************************************************************************
 * @fn					- I2C_Master_RX
 *
 * @brief				- Calls start() and manages the transfer of data when master wants to recieve

 *
 * @param[in]			- pI2CHandle: Struct to take in user input for config settings and use them to implement logic in this function. Also allows access to I2C registers
 *						- pData_buf: Array (pointer) that contains all the data received
 *
 * @return				- I2C_Status_t
 *
 * @Note				- NOTE: This function assumes that I2C_Config_Master() has been called prior to this function. This function will not function correctly if it is not
 * 						- called first.
 * 						- Also, I2C_NBYTES must be configured. This is a requirement for data TX
 * 						- This is a polling based function. WIll implement one with interrupts later and probably just use that in the future. But this is a good start
 *
 **************************************************************************************/
I2C_Status_t I2C_Master_RX(I2C_Handle_t* pI2CHandle, uint8_t* pData_buf, uint8_t repeated_start){
		if ((pI2CHandle == NULL) || (pI2CHandle->pI2C1 == NULL) || (pData_buf == NULL)
				|| (pI2CHandle->I2C_PinConfig.I2C_NBYTES == 0U)  || (pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR != READ)) {
			return I2C_ERR_INVALID_PARAM;
		}

		// Wait for bus to be free (not BUSY)
		// TODO: Add timeout in this so it doesnt hang forever if an error occurss (STOPF never set). Fine for now since doing early testing
		if (repeated_start != 1){ // If it = 1 then this while loop shouldnt execute because line will be busy forever
			while (pI2CHandle->pI2C1->ISR & (1U << 15));
		}

