maxwellalec868-lang/autonomous_car_project/drivers/Src/stm32f334xx_i2c_driver.c
		I2C_Start(pI2CHandle->pI2C1);
		uint8_t ind = 0;

		// (1) Wait until RXNE = 1. Then read data into pData_buf
		// (2) Repeat step one NBYTES amount of times
		// (3) Handle transfer completion for AUTOEND = 0 and = 1
		// First handle data transfer
		while (ind < pI2CHandle->I2C_PinConfig.I2C_NBYTES){

			// Wait till RXNE is set
			while (!(pI2CHandle->pI2C1->ISR & (1U << 2))){
				// if NACK returned, return err enum
				if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
					pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
	                return I2C_ERR_NACK;

	                // TODO: Possibly add error handles for OVR, ARLO, BERR
				}
			}

			pData_buf[ind] = (uint8_t)pI2CHandle->pI2C1->RXDR;
			ind++;
		}


		// Then handle receive completion
		// In master receive mode, hardware handles the final NACK.
		// If AUTOEND = 1, hardware also generates STOP automatically
		if (pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN == 0){

			while (!(pI2CHandle->pI2C1->ISR & (1U << 6))){ // Wait till TC bit is set

				if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
					pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
					return I2C_ERR_NACK;
				}
			}

			// Stop I2C after I2C TC bit is set
			I2C_Stop(pI2CHandle->pI2C1);
			while (!(pI2CHandle->pI2C1->ISR & (1U << 5))) {
				if (pI2CHandle->pI2C1->ISR & (1U << 4)) {
					pI2CHandle->pI2C1->ICR |= (1U << 4);
					return I2C_ERR_NACK;
				}
			}
		}

		else{
			while (!(pI2CHandle->pI2C1->ISR & (1U << 5))){ // Wait till STOPF bit is set
				if ((pI2CHandle->pI2C1->ISR & (1U << 4))){
					pI2CHandle->pI2C1->ICR |= (1U << 4); // Clear NACKF before returning so if called again functions correctly
					return I2C_ERR_NACK;
				}
			}
		}

		// Clear STOPF (using STOPCF) so another transfer can be successfully initialized
		if ((pI2CHandle->pI2C1->ISR & (1U << 5))){
			pI2CHandle->pI2C1->ICR |= (1U << 5);

		}

		return I2C_OK;

}


/**************************************************************************************
 * @fn					- I2C_Master_Reg_Read
 *
 * @brief				- Will call I2C_Master_TX(repeated_start) function to initiate the register pointer of slave that I wish to read from. Then I2C_Master_RX() will be called to
 * 						- read the desired amount of bytes from slave register.
 * 						- This is a hihger-level helper function to I2C_Master_RX() that will actually allow for an proper reception of data from a slave register

 *
 * @param[in]			- pI2CHandle: Will hold the configs for TX function to set the address for RX
 *						- start_reg_addr: The address of the register that needs to be sent using the TX function to initiate the starting pointer in slave device
 *						- pData_buf: Data buffer to hold all data read from I2C
 *						- num_bytes: This value will specify the amount of bytes that should be read from the slave pointer address specified by start_reg_addr. If this number
 *						  larger than the size of start_reg_addr then it will read bytes from the next contiguous register
 *
 * @return				- I2C_Status_t: Returns a status enum, if I2C_OK outputs all is good else program stops
 *
 *
 * @Note				- IMPORTANT NOTE 1: This function writes one starting register address to slave, then reads num_bytes beginning at that address.
 *						  If the slave supports auto-increment, the multiple consecutive registers may be read in one call
 *						  If various non-contigous registers need to be read from then multiple calls to this function will need to be made!
 *
 *						- IMPORTANT NOTE 2: Configs are handled inside this function. Do not worry about setting configs and calling I2C_Config_Master() prior to this function
 *						  call as it is not needed and will most likely cause issues.
 *
 **************************************************************************************/
I2C_Status_t I2C_Master_Reg_Read(I2C_Handle_t* pI2CHandle, uint8_t start_reg_addr, uint8_t* pRx_data_buf, uint8_t num_bytes){
	/*
	 * (0): Reconfigure pI2CHandle so it is configured for WRITE, NBYTES=1, AUTOEND = 0. I believe every other config does not matter
	 * (1): Start by modifying I2C_Master_TX() so it can take a param for not generating a STOP bit
	 * (2): Call I2C_Master_TX() and pass start_reg_addr as p_dataBuf so it gets written to slave. Ensure to call repeated_start
	 * (3): Rewrite the configs so they are ready for RX
	 * (4): Then call I2C_Master_RX() to read the data and pass new configs
	 *
	 * */
	if ((pI2CHandle == NULL) || (pRx_data_buf == NULL) || (num_bytes == 0)) {
	    return I2C_ERR_INVALID_PARAM;
	}

	// Save state of all PinConfig configs that I am changing so I can restore at the end of the program
	uint8_t transfer_dir_state = pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR;
	uint8_t nbytes_state = pI2CHandle->I2C_PinConfig.I2C_NBYTES;
	uint8_t autoend_state = pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN;


	// Configure for TX of 1 byte containing register I want to read from
	pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR = WRITE;
	pI2CHandle->I2C_PinConfig.I2C_NBYTES = 1;
	pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN = DISABLE;
	I2C_Config_Master(pI2CHandle);


	uint8_t repeated_start_en = 1;
	// I2C_Master_TX() just being used to transmit an register address to initialize the pointer of the slave so its at that address
	I2C_Status_t tx_status = I2C_Master_TX(pI2CHandle, &start_reg_addr, repeated_start_en);
	if (tx_status != I2C_OK){
		pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR = transfer_dir_state;
		pI2CHandle->I2C_PinConfig.I2C_NBYTES = nbytes_state;
		pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN = autoend_state;
		I2C_Config_Master(pI2CHandle);

		return tx_status;
	}

	// Will need to verify and check these. May need to add more
	pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR = READ;
	pI2CHandle->I2C_PinConfig.I2C_NBYTES = num_bytes;
	pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN = ENABLE; // Ok to enable now since transfer done after this
	I2C_Config_Master(pI2CHandle);

	I2C_Status_t rx_status = I2C_Master_RX(pI2CHandle, pRx_data_buf, repeated_start_en);

	// Data should now be read into pRx_data_buf which can be accessed in main where function called
	if (rx_status != I2C_OK){
		pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR = transfer_dir_state;
		pI2CHandle->I2C_PinConfig.I2C_NBYTES = nbytes_state;
		pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN = autoend_state;
		I2C_Config_Master(pI2CHandle);

		return rx_status;
	}

	// Restore state of pinConfig before returning so it is in the same state as it was when the user sent it to this function
	pI2CHandle->I2C_PinConfig.I2C_TRANSFER_DIR = transfer_dir_state;
	pI2CHandle->I2C_PinConfig.I2C_NBYTES = nbytes_state;
	pI2CHandle->I2C_PinConfig.I2C_AUTOEND_EN = autoend_state;
	I2C_Config_Master(pI2CHandle);

	return I2C_OK;
}

